In [1]:
import pyodbc
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=MSI\MSSQLSERVER01;'
                      'Database=PythonSQL;'
                      'Trusted_Connection=yes;')
cursor = conn.cursor()

In [2]:
sql = """ select * from employee order by age"""
cursor.execute(sql)
for i in cursor :
    print(i)

('Krishna             ', 'Sharma              ', 19, 'M', 2000.0)
('Raj                 ', 'Kandukuri           ', 20, 'M', 7000.0)
('a                   ', 'b                   ', 23, None, 10000.0)
('Ramya               ', 'Ramapriya           ', 25, 'F', 5000.0)
('Mac                 ', 'Mohan               ', 26, 'M', 2000.0)
('abc                 ', 'XYZ                 ', 45, None, None)

In [3]:
sql = """ select * from employee order by age asc"""
cursor.execute(sql)
for i in cursor :
    print(i)

('Krishna             ', 'Sharma              ', 19, 'M', 2000.0)
('Raj                 ', 'Kandukuri           ', 20, 'M', 7000.0)
('a                   ', 'b                   ', 23, None, 10000.0)
('Ramya               ', 'Ramapriya           ', 25, 'F', 5000.0)
('Mac                 ', 'Mohan               ', 26, 'M', 2000.0)
('abc                 ', 'XYZ                 ', 45, None, None)

In [4]:
sql = """ select * from employee order by age desc"""
cursor.execute(sql)
for i in cursor :
    print(i)

('abc                 ', 'XYZ                 ', 45, None, None)
('Mac                 ', 'Mohan               ', 26, 'M', 2000.0)
('Ramya               ', 'Ramapriya           ', 25, 'F', 5000.0)
('a                   ', 'b                   ', 23, None, 10000.0)
('Raj                 ', 'Kandukuri           ', 20, 'M', 7000.0)
('Krishna             ', 'Sharma              ', 19, 'M', 2000.0)

In [5]:
sql = """ select SEX, count(1) from employee group by SEX"""
cursor.execute(sql)
for i in cursor :
    print(i)

(None, 2)
('F', 1)
('M', 3)